import { Component , OnInit} from '@angular/core';

@Component({
  selector: 'app-curriculum',
  templateUrl: './curriculum.component.html',
  styleUrls: ['./curriculum.component.css']
})
export class CurriculumComponent implements OnInit{
  ngOnInit(): void {
    debugger
  }
   cards = [
    {
      order: '١',
      image: 'http://www.example.com/image.gif',
      title: 'الثقة في القدرة على الإنجاز',
      content:
        'في هذه المرحلة يدخل الشباب في تجارب مختلفة ويطلب منهم إنجاز مهمات محددة ليبنوا من خلالها ثقتهم على الإنجاز.',
    },
    {
      order: '٢',
      image: 'http://www.example.com/image.gif',
      title: 'الثقة في القدرة على تحمل المسؤلية',
      content:
        'وفيها يتحمل الشباب بعض المسؤليات لمهمات في مشاريع مختلفة لبناء ثقتهم وقدرتهم على تحمل المسؤليات.',
    },
    {
      order: '٣',
      image: 'http://www.example.com/image.gif',
      title: 'الثقة في فكره و ابداعه',
      content:
        'بعد الشعور بالقدرة و المسئولية يكون الشاب قادر على الإبداع و التخيل و هو واثق أنها أفكار قيمة فهنا يبدأ فى الثقة فى فكره. (صنع الله الذى أتقن  كل شئ).',
    },
    {
      order: '٤',
      image: 'http://www.example.com/image.gif',
      title: 'الثقة فى تفكيره المنطقى',
      content:
        'التفكير المنطقى هو ما يستخدم الإبداع فى التطبيق على أرض الواقع. فلابد من تنمية التفكير المنطقى لدى الشاب حتى يتمكن من إستخدام قدرته على الإبداع فى تطبيقات عملية واقعية.',
    },
    {
      order: '٥',
      image: 'http://www.example.com/image.gif',
      title: 'القدرة على إتخاذ القرار',
      content:
        'بعد الأربع مراحل الأوائل التى يمكن أن نطلق عليها مراحل تكوين الثقة بالنفس تأتى مرحلة كيفية إتخاذ القرار و الثقة فى القدرة على أخذ القرار الحر المستقل المناسب للشخص نفسه و تحمل عواقب القرار أيا كانت.',
    },
    {
      order: '٦',
      image: 'http://www.example.com/image.gif',
      title: 'توضيح النية و الدافع وراء كل عمل',
      content:
        'هنا ينتقل الإنسان إلى مرحلة جديدة بعد مراحل الثقة بالنفس و القدرة على إتخاذ القرار و بعد أن كان يفعل الأشياء كلها و المهمات كلها بناءا على توجيه و طلب ليفكر فى معنى النية و الدافع و أنه لكى يكون إنسان مؤثر لابد من أن يتحرك فى الدنيا بدافع شخصى و نية قاصدة لله وحده.',
    },
    {
      order: '٧',
      image: 'http://www.example.com/image.gif',
      title: 'المبادرة و المسئولية تجاه المجتمع',
      content:
        'هنا يبدأ الشاب فى التعود على أن يكون مبادر و لا ينتظر أحد ليطلب منه الإصلاح أو العمل.',
    },
    {
      order: '٨',
      image: 'http://www.example.com/image.gif',
      title: 'إدراك المميزات الشخصية',
      content:
        'هنا نبدأ مع الشاب فى أخر مرحلة قبل التأثير الحقيقى و هى ما يطلق عليها SWOT Analysis  .. و نبدأها بمعرفة نقاط القوى و التميز من مهارات و مواهب و ذكاءات حتى يستطيع الشاب التركيز على نقاط قوته لينميها فيصبح مميزا .. و أيضا فى هذه المرحلة مهم جدا أن يدخل فى تجارب غير ناجحة فيستبعد قدرات و مهارات معينة من شخصيته و يركز أكثر على ما يميزه.',
    },
    {
      order: '٩',
      image: 'http://www.example.com/image.gif',
      title: 'فهم و إدراك العالم الخارجى',
      content:
        'فى هذه المرحلة يبدأ الشاب فى الإحتكاك المباشر بالحياة الواقعية العملية فيفهم متطلبات المجتمع و يستكشف الفرص التى يمكن أن يستغلها و يعمل على تطويرها مستخدما مميزاته الشخصية.',
    },
    {
      order: '١٠',
      image: 'http://www.example.com/image.gif',
      title: 'وضع خطة شخصية و متابعة تنفيذها',
      content:
        'بما أن هذه هى المرحلة الأخيرة فى المراحل العشرة و بعد أن أتم الشاب التسع مراحل السابقة و بالأخص المرحلة التاسعة و العاشرة أصبح قادرا على تحديد نقاط القوة و الضعف لديه و عنده إدراك بما يحدث حوله يصبح قادرا على تحديد كيفية توظيف قدراته فى عمل مناسب يستوعب طاقاته و يشجعه على الإبداع و التميز. فيبدأ فى هذه المرحلة فى تحديد "رسالته" فى الحياه و و ضع خطة محددة و عملية ثم البدئ فى تنفيذها و متابعتها و تعديلها كلما استدعى الأمر.',
    },
  ];
}
